#include <iostream>
using namespace std;

int main() {
    int temp;
    cout << "¬вед≥ть температуру (∞C): ";
    // ¬веденн€ температури
    cin >> temp;

    // ѕочинаЇмо перев≥рку в≥д найсувор≥шоњ умови (найнижчоњ температури)
    if (temp <= 0) {
        cout << "Ѕеремо теплий од€г та рукавички" << endl;
    }
    // якщо не менше або дор≥внюЇ 0, перев≥р€Їмо, чи входить у д≥апазон [1, 15]
    else if (temp <= 15) {
        cout << "¬≥зьм≥ть легку куртку" << endl;
    }
    // якщо не менше 15, перев≥р€Їмо, чи входить у д≥апазон [16, 25]
    else if (temp <= 25) {
        cout << "ћожна од€гати футболку" << endl;
    }
    // якщо жодна з попередн≥х умов не спрацювала (тобто temp > 25)
    else {
        cout << "Ћегкий од€г, сонцезахисн≥ окул€ри" << endl;
    }

    return 0;
}